<!--python-->
<ul class="collapsible popout" data-collapsible="accordion">
    <li>
        <div class="collapsible-header">Операции с типами данных</div>
        <div class="collapsible-body">
            <h5>List() || []</h5>
            <div class="card-panel">
                <p><b>append(item):</b> добавляет элемент item в конец списка</p>
                <p><b>insert(index, item):</b> добавляет элемент item в список по индексу index</p>
                <p><b>remove(item):</b> удаляет элемент item. Удаляется только первое вхождение элемента. Если элемент не найден, генерирует исключение ValueError</p>
                <p><b>clear():</b> удаление всех элементов из списка</p>
                <p><b>index(item):</b> возвращает индекс элемента item. Если элемент не найден, генерирует исключение ValueError</p>
                <p><b>pop([index]):</b> удаляет и возвращает элемент по индексу index. Если индекс не передан, то просто удаляет последний элемент.</p>
                <p><b>count(item):</b> возвращает количество вхождений элемента item в список</p>
                <p><b>sort([key]):</b> сортирует элементы. По умолчанию сортирует по возрастанию. Но с помощью параметра key мы можем передать функцию сортировки.</p>
                <p><b>reverse():</b> расставляет все элементы в списке в обратном порядке</p>
                <p>Кроме того, Python предоставляет ряд встроенных функций для работы со списками:</p>
                <p><b>len(list):</b> возвращает длину списка</p>
                <p><b>sorted(list, [key]):</b> возвращает отсортированный список</p>
                <p><b>min(list):</b> возвращает наименьший элемент списка</p>
                <p><b>max(list):</b> возвращает наибольший элемент списка</p>
            </div>
        </div>
    </li>
</ul>
